export const QIMEN_TEN_GAN_TOOLTIP_TEXT = {
	甲: `甲
挺立．老大
权威，名贵，一流
挺拔，上进，奋斗
直爽，高傲
有壳，保护`,
	乙: `乙
柔曲．依附
曲折，柔弱，依附，委婉，骑墙
艺术，希望，美女，妻子
中医，草药，风
沟通`,
	丙: `丙
放射．表现
热烈，权柄，争斗，动乱
希望，光明
雄壮，急躁，虚荣
能源
圆形
宣传`,
	丁: `丁
闪烁．亮眼
突出，尖锐，亮眼，闪烁，奇迹
文字，意义，目光
文书，票证
小三、玉女
阴茎
IT`,
	戊: `戊
收容．积聚
钱，资本，资产，金融，容器
包容，宽厚，稳重，不变
房子，土地
大肉，胖，厚`,
	己: `己
阴险．谋划
欲望，邪念，阴险，谋划，弯曲
低洼，坑，陷阱
厕所，排泄，垃圾
小肉
嘴`,
	庚: `庚
凶猛．敌对
凶狠，霸道，武断，肃杀
阻隔，打斗
骨头，坚硬，金属
癌症
武器`,
	辛: `辛
变化．革新
错误，问题，改革，创新
叛逆，激烈
变化，要害
金玉，首饰
颗粒，铜钱`,
	壬: `壬
流动．放纵
聪明，逻辑
无主，迷茫，漂动
风流，纵欲
运输，旅行
动脉`,
	癸: `癸
沉迷．浑浊
浑浊，阴柔，沉溺，迷醉
多情，多愁，多欲
酒，茶，汤，污水，浑浊物
静脉
鞋
鬼`,
};

export const QIMEN_DOOR_TOOLTIP_TEXT = {
	休: `休門
坎，子

休养
休息、休闲、懒散
旅游、婚姻、家庭
卧室、清闲
退休、幕贵、老领导
宽松、温和、休止
萎靡、潜伏

物象
清闲物：公务员、僧道、贵人、养老、暗箱操作
悠然物：旅游、度假、娱乐
流动物、水中物：车船、运输、路、能动家电酒水、河海、含水多的果蔬、水中动物、鱼、水牛
注：休门是最好的恋情，互予呵护，温润如玉`,
	生: `生門
艮，寅，金墓

生息
生长、生产、生机
生意、利润、利息
土地、房产
连绵、延续、不断
活跃、发展、乐观
守信、买卖

物象
鲜活物：一切生活状态好的动植物
生养物：生活所需的必需品（钱、吃喝、住房）
生产物：工厂、车间、车床生产部门、种植养殖、老板
交易物：交易所、商超、市场`,
	伤: `傷門
震，卯

伤害
伤身、伤痛、伤心
伤人、搏斗、破坏
攻击、捕捉、打猎
冒险、竞争、引诱

物象
危险物：武器锐器（刀剑、剪刀、针、枪炮等）、爆炸物、公检法、悬崖
损坏物：残缺不全物
快速物：车船、司机、运动员
捕捉物：军警、猎人、蚊子、跳蚤、猎狗、野猫、狮虎
攻击物：进攻部队`,
	杜: `杜門
巽，巳，水墓

阻塞
阻隔、限制、困难
拥堵、不明、隐藏、躲避
技术、秘密、保密
隐瞒、内向、沉默、防御

物象
阻隔物：墙壁、堤坝、瓶盖、门窗、监狱、衣服、胸罩、避孕套、宅男、窗帘
技术物：专利、精密技术
隐藏物：夜行动物、躲藏动物、鼠、蛇、猫
排他物：商标、贞洁
防御物：防御部队、盾牌、盔甲、手套`,
	景: `景門
離，午

亮麗
好看、美丽、美女、帅哥
明星、表演、风景
显眼、文书、文件、信息
喜庆、婚宴、繁华
血液、心脑、血管
急躁、理想、幻想

物象
观赏物：打扮、美色、美容、明星、景色
照片、摄影、装饰
信息物：文件、证件、证书、广告
展示物：电视、电脑
光照物：灯光、眼、相机
显眼物：吸引目光之物`,
	死: `死門
坤，申，木墓

死寂
寂灭、安静、不动
死亡、结束、困境、低谷
迟滞、呆板、不变、迟钝
闷气、内向、保守、死理
深沉
痕迹、疤痕、古老

物象
静止物、废弃物：废屋、废井、仓库、空置房、雕塑、木偶、玩具、枷锁、固定资产
死亡物：亡人照、棺木、坟墓、墓碑、医院、停尸间、殡仪馆、刑场
缓慢物：行动缓慢的动物、生长缓慢的植物、牛羊、松柏`,
	惊: `驚門
兌，酉

惊恐
惊吓、受惊、害怕
口舌、诉讼、口才
辩论、刺激、嘈杂

物象
口才物：律师、老师、歌手、主播、导游、销售、公关、说唱
发声物：乐器、音响、风铃、蝉、蛙、蟋蟀、鸟、闹市区、KTV
刺激物：投资、投机、金融、比赛、影院、派出所
怪异物：妖异、怪事`,
	开: `開門
乾，亥，火墓

开阔
开拓、开创、创业
事业、工作、单位
公权、升迁
开放、公开、门面
天空、泄密、清晰
明朗、爽达

物象
开阔物：平原、旷野、广场、大房、大平层、大办公室
贵重物：金银、珠宝
远行物：车站
飞天物：飞机、飞船、鸟`,
};

export const QIMEN_STAR_TOOLTIP_TEXT = {
	蓬: `天蓬
坎，壬癸，黑

游侠
胆魄、冒险、聪明
好色、阴暗、风流、浪荡
多变、贪大、雄略
魅力，性张力，情种
强为边将，弱为黑道

行业
有风险，突破边界，恣意捞偏门
风月场所、酒吧、洗浴、餐饮、水产养殖

物像
蓬松物、蓬状物：伞、棚、顶、亭、桥、娱乐场、透风房
多毛物、水生物：鼠、蝙蝠、鱼、蘑菇、伞叶植物（荷花蓬草等）`,
	任: `天任
艮，戊，黃

农夫
忠厚、老实、保守
安稳、承担、责任
缓慢、固执、呆板、辛劳
任劳任怨
魅力低
性张力差，性能力低
怕老婆
强为高管，弱为工人

行业
无风险，脚踏实地，听令于人
工业、农业、制造业、矿产、建筑、土木、胖、肉厚、脸黄

物象
铺垫物、倚靠物、收容物：床、椅、桌、被、鞋、柜、马、牛、骆驼
缓变物、起伏物：梯、丘、台阶、起伏道路、龟
朴实物、山中物：稻谷、城隍土地、矿物、玉米、山果`,
	冲: `天沖
震，甲，綠

武士
冲击、冲动、冲撞
快速、敏捷、急迫、早泄
涌动、鲁莽、直接、冒失
雷厉风行
快枪手，没耐心
易怒，不稳重

行业
快速变化，新鲜刺激，临机应变
武行、军警、商店、电器、科技、音乐

物像
交通物、高大物：飞机、汽车、机场、车站、飞船、高楼、大树、竹子
鸣叫物、噪动物：乐器、音响、枪炮、火箭、烟花、鞭炮、游乐场、蟋蟀、跳蚤、羚羊、松鼠`,
	辅: `天輔
巽，乙，綠藍
文昌位

师相
辅佐、指导、奉献、温雅
教授、学习、文化、技术
传播、传染
有教养，彬彬有礼，含蓄稳重
谦恭节制，同情包容
柔和温存

行业
传播，辅佐别人，教授指导
文教，设计，规划，老师，工艺
技术支持，抛砖引玉

物像
辅助物、保护物：衣服、羽绒、护甲、家具、桌椅、空调、风扇、窗口、窗帘
沟通物、谋划物：电线、绳子、围墙、栅栏、隔离带、学校
弯曲物：葫芦、花草、丝瓜、泥鳅、蛇、带鱼`,
	英: `天英
離，丙丁，紅

明星
亮丽、好看、漂亮、英俊
表现、才华、大方
光明、刚烈、燥热
表象
爱表现，自恋自信
热情明朗
虚荣浮夸，易怒好胜
公关社交

行业
靠形象人设，好看亮丽
演艺、社交、公关、模特、照亮、美容、电子电器、电视电脑、能源、火业

物像
亮丽物、明显物：美女、帅哥、妆容、证件、花、烟花、锦鲤、热带鱼、热闹场
阳光物、能源物：太阳、眼、灯、炉灶、阳台、电站
眼看物：书、电视、电脑、影视、图片、电影院`,
	芮: `天內（天芮）
坤，己，黃

医生
疾病、问题、麻烦
懦弱、慢性、迟钝
固执、懦弱、内向
修行
沉静内敛，封闭自守
一根筋，认真严肃
练死劲，钻牛角尖
注：天内=认真严肃，天內出问题，就不认真、不严肃。常用于学习态度。

行业
解决问题，处理麻烦，批判指正
医疗、中小学老师、卫生业、医疗器械、肉品加工

物像
医疗物、纠正物：药，医院，道观，寺庙，女神，书店，图书馆
问题物、损坏物：器质病变，坏电器，破裂屏幕
土生物：花生、地瓜、家禽、孕妇`,
	禽: `天禽
坐镇中宫
不参与变化`,
	柱: `天柱
兌，辛，白

于谦
柱石、脊梁
叛逆、反调、折腾
辩论、破坏
独特、小众、冷酷
独当一面，力挽狂澜
特立独行，一意孤行
霸占主动

行业
重用口才，先破后立，发扬破坏（惩罚），惩恶扬善
律师、检察官、法官、销售、中介、军事、重工业、机械修理

物像
发声物：（发声）钟表、音响、电视、乐器、狗、公鸡、鸟、画眉
柱状物：钢管、水泥管、烟囱、高塔、水塔、木棒、筷子、脊柱、腰椎`,
	心: `天心
乾，庚，白

君王（嘉靖）
中心、领导、监管
组织、策划、庙堂
哲学、道理
老成、持重
策划缜密
领导组织、持重条理
注：天心=学习方式

行业
管理经营，用心计
规划、咨询、整合资源、西医

物像
贵重物、中心物：金银、珠宝、神像、令印、领导办公室、市中心、CBD、塔、狮子
金属物：西医药、西医器械、金属制品
开阔物：平原、郊野、金融`,
};

export const QIMEN_GOD_TOOLTIP_TEXT = {
	值符: `值符
在離，陽火

领导（替甲）
贵、权、管、显

象
第一、中心、上司、老板、裁判
高档、名贵、显眼、稀有、标志、国旗、直属领导、家庭主妇`,
	螣蛇: `騰蛇
在巽，陰火

妖异
惊、妖、艳
梦、幻
缠、骗、伪

象
奇怪、狡猾、欺诈、虚假、难缠、缠人
足智多谋、变化、灵异、弯曲、缠绕、反复、善变、感情不稳定、疾病反复`,
	太阴: `太陰
在坤，陰金

阴谋
密、暗
谋、私
护、女
精

象
心思细腻、多愁善感、擅策划、爱沉思
精致、细致、金玉首饰、精致细致物品、艺术品
暗中贵人、冥助、隐藏之人、二奶、女性偶像`,
	六合: `六合
在震，木

人缘
合、媒、多、伙
婚、恋、约、缘

物象
合作、合伙、婚姻
多、人缘好、牵连、中介、月老
能开合（柜门，鱼水之欢）
小孩`,
	白虎: `白虎
在兌，陽金

凶猛
斗、阻、暴
威、霸、害
硬、猛

物象
阻力、阻隔、严厉、易怒、冲动、风水凶煞、疾病死伤
强硬者，有手段者、公检法、黑社会`,
	玄武: `玄武
在坎，水

盗耗
偷、谎、假
黑、贿
晕、迷、玄

物象
偷窃、盗贼、偷人
玄秘、迷糊、眩晕、迷雾
不确定、不可靠、说谎、失物、道听途说、悬挂`,
	九地: `九地
在艮，土

坚固
稳、固
久、慢
矮、守

物象
稳定、厚重、包容、关怀、老练、稳扎稳打、被动消极
压抑、低洼、地下室、地窖、地面及以下`,
	九天: `九天
在乾，陽金

高远
远、飞
变、动
高、扬、志、吹、阔

物象
太高、太远、渺茫、不切实际
宏大、壮志凌云、风云激荡、高谈阔论、吹牛、情怀
变动不居、求新求变`,
};
